package lesson_09.hw_biblio;

public class HomeWork_09 {
    public static void main(String[] args) {
        /**
         * Задача 1
         * Выполнить в классной работе требование к задаче:
         *  3. Найти в массиве самый старый диск (printOldestMedia) и вывести информацию о нем на экран.
         */


        /**
         *Задача 2
         * Вы работаете над программой-каталогом для библиотеки.
         * 1. Разработать классы для хранения информации о печатных изданиях:
         *      - книгах (название, автор, год издания, количество страниц, издательство);
         *      - журналах (название, год выхода, номер выпуска, издательство);
         * 2. Создать массив печатных изданий с неоднородным составом (хранятся как книги, так и журналы),
         *    заполнить его несколькими элементами, вывести все элементы этого массива на экран.
         * 3. Найти в массиве самое толстое издание и вывести информацию о нем на экран.
         * 4. Пояснить, где и зачем в данной программе используется полиморфизм.
         *
         *      Замечания:
         *      - Придумайте название классов в соответствии с их назначениям;
         *      - Помните о скрытии данных (инкапсуляция).
         *      - Там где необходимо, используйте наследование.
         */
    }
}
