package lesson_21;

public class HomeWork_21 {
    /**
     * 1. —оздать аккаунт в gitHub
     * 2. ”становить git локально, ссылка на скачивание: https://github.com/git-guides/install-git
     * 3. Lesson_20 доделать сортировку по mark
     * 4. ƒоделать холодильник
     */

    /**
     * ¬ классе Fridge сделать метод checkCanCook(), который должен проверить чего не хватает в холодильнике
     * и если хватает продуктов, тогда напечатать "ѕродуктов дл€ данного рецепта достаточно!", а если не хватает или
     * чего-то совсем нет, тогда вывести список чего и в каком объеме не хватает.
     */

    /**
     * ѕо аналогии с примером холодильника и рецепта написать свой вариант программы где вместо холодильника есть склад
     * с товарами, а вместо рецепта есть корзина покупател€. ” склада создать метод canBay()по аналогии с canCook() и
     * метод checkCanBay()() по аналогии с checkCanCook()
     */
}
