package lesson_01;

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");

        // однострочный комментарий
        /* многострочный

         */

        /**
         * Многострочный с заголовком
         */
        /**
         * Типы данных:
         *          - Примитивные типы (8 видов) - с маленькой буквы;
         *          Целочисленные (значение по умолчанию 0):
         *          byte - 8 bits (1 bytes), 2 в 8-й степени, значения числа от -128 до 127
         *          short - 16 bits (2 bytes), 2 в 16-й степени, значения числа от -32 768 до 32 767
         *          int - 32 bits (4 bytes), 2 в 32-й степени, значения числа от -2 147 483 648 до 2 147 483 647 (миллиарды)
         *          long - 64 bits (8 bytes), 2 в 64-й степени, значения числа от -9 223 372 036 854 775 808 до 9 223 372 036 854 775 807 (квинтиллионы)
         *
         *          Дробные или "с плавающей точкой" (значение по умолчанию 0):
         *          float - 32 bits (4 bytes), 3.4*10^38, точность после запятой 7 цифр, {1 bits - знак, 8 bits - порядок, 23 bits - точность}
         *          double - 64 bits (8 bytes), 1.7*10^307, точность после запятой 15 цифр
         *
         *          Логический тип:
         *          boolean - 1 bits (1 bytes), принимает два значения False (ложь) ИЛИ True (истина)
         *
         *          Символьный тип:
         *          char - 16 bits (2 bytes), таблица символов ASCII
         *
         *
         *          - Ссылочные типы (бесконечно много) - с большой буквы
         *          1. Ссылочные типы от JDK (стандартные);
         *          2. Ссылочные типы созданные программистом;
         *          3. Ссылочные типы из интернета созданные другими программистами;
         */
    }
}