package lesson_15;

public class HomeWork_15 {
    public static void main(String[] args) {
        /**
         * Задача:
         * Создать объект "Цилиндр" и метод по установке его параметров: 1. Радиус; 2. Высота;
         * В методе реализуйте проверки на то что указаны положительные цифры в параметрах метода
         * и если это так, тогда посчитайте и выведите на консоль объем цилиндра.
         * Если проверки не будут пройдены, то выбросите ошибку с сообщением какое условие не выполнено.
         * В Main вашей программы при окружении вашего метода блоком try catch вызовите в блоке catch
         * у вашей ошибки метод getMessage().
         *
         */
    }
}
